##########################################################################
# Написати функцију emhasise(наслов) којој је параметар стринг и која враћа нови стринг 
# гдје су сви параметри велики, тј. сва слова су написана великим словима и сва слова су 
# одвојена размацима. Простор између стрингова треба бити посматран на исти начин као и
# остали карактери.
#
# Примјер:
#	>>> emphasise('Breaking news')
#       'B R E A K I N G   N E W S'
##########################################################################



##########################################################################
# Написати функцију emphasise_marked(title) који враћа нови стринг гдје су једино
# карактери између * (у оригиналном издању) конвертовани у велика слова. Карактери *
# требају бити обрисани у новом стрингу.
#
# Примјер:
#      >>> emphasise_marked('Breaking *news* on Donald *Trump*')
#      'Breaking NEWS on Donald TRUMP'
##########################################################################



##########################################################################
# Написати функцију is_palindrome(s) која враћа True ако је стринг s палиндром 
# и која враћа False ако није.
#
# Примјер:
#      >>> is_palindrome('neradodaren')
#      True
#      >>> is_palindrome('math')
#      False
##########################################################################



##########################################################################
# Кажемо да је стринг скоро палиндром ако му требамо обрисати тачно један карактер
# да бисмо добили палиндром. Ријеч kolo је скоро палиндром, јер једино требамо обрисати
# слово k да добијемо olo.
#
# Примјер:
#      >>> almost_palindrome('kolo')
#      True
#      >>> almost_palindrome('famnit')
#      False
##########################################################################



##########################################################################
# Кажемо да је стринг псеудо-палиндром ако требамо додати или обрисати тачно једно
# слово или замијенити га са другим тако да добијемо палиндром. Примјери:
#   * robot (replace t with r)
#   * jana (add letter j at the end)
#
# Написати функцију pseudo-palindrome(s) која враћа True ако и само ако је стринг s
# псеудо-палиндром.
#
# Примјер:
#      >>> pseudo_palindrome('robot')
#      True
#      >>> pseudo_palindrome('famnit')
##########################################################################



