##########################################################################
# Написати функцију emphasise(title) којој је параметар стринг и која враћа
# нови наглашени стринг где су сва слова велика и раздвојена размацима.
# 
# Пример:
#
#     >>> emphasise('Breaking news')
#     'B R E A K I N G   N E W S'
##########################################################################



##########################################################################
# Написати функцију emphasise_marked(title) која враћа нови стринг у којем
# су речи између карактера * наглашене. Карактере * треба избацити из
# резултујућег стринга.
#
# Пример:
#
#     >>> emphasise_marked('Breaking *news* on Donald *Trump*')
#     'Breaking NEWS on Donald TRUMP'
##########################################################################



##########################################################################
# Написати функцију is_palindrome(s) која враћа True ако је стринг s
# палиндром и False ако није.
#
# Пример:
#
#     >>> is_palindrome('neradodaren')
#     True
#     >>> is_palindrome('math')
#     False
##########################################################################



##########################################################################
# Кажемо да је стринг скоро палиндром ако треба да обришемо тачно један
# карактер како бисмо добили палиндром. Реч 'kolo' је скоро палиндром зато 
# што треба обрисати само једно слово како би се добила реч 'olo'.
#
# Написати функцију almost_palindrome(s) која враћа True ако је стринг s
# скоро палиндром.
#
# Пример:
#
#     >>> almost_palindrome('kolo')
#     True
#     >>> almost_palindrome('famnit')
#     False
##########################################################################



##########################################################################
# Кажемо да је стринг псеудо-палиндром ако треба да додамо или обришемо тачно
# једно слово или га заменимо другим како бисмо добили палиндром. Примери:
#
# * robot (замењено t са r)
# * jana (додато слово j на крај)
#
# Написати функцију pseudo_palindrome(s) која враћа true ако и само ако је
# стринг s псеудо-палиндром.
#
# Пример:
#
#     >>> pseudo_palindrome('robot')
#     True
#     >>> pseudo_palindrome('famnit')
##########################################################################
